alter table public.mindex_sunday_calendar
  add column if not exists youth_offering_prayer text not null default '',
  add column if not exists liturgical_color text not null default '',
  add column if not exists first_reading text not null default '',
  add column if not exists psalm text not null default '',
  add column if not exists second_reading text not null default '',
  add column if not exists gospel text not null default '';

insert into public.mindex_sunday_calendar
  (date, liturgical, note, church_schedule, preacher, nursery_prayer, children_prayer, youth_prayer, young_adult_prayer, youth_offering_prayer, liturgical_color, first_reading, psalm, second_reading, gospel)
values
  ('2025-11-30', '대림절 첫 번째 주일', '', '', '', '', '', '', '', '', '보라색', '이사야 2:1-5', '시편 122편', '로마서 13:11-14', '마태복음 24:36-44'),
  ('2025-12-07', '대림절 두 번째 주일', '', '', '', '', '', '', '', '', '보라색', '이사야 11:1-10', '시편 72:1-7, 18-19', '로마서 15:4-13', '마태복음 3:1-12'),
  ('2025-12-14', '대림절 세 번째 주일', '성서주일', '', '', '', '', '', '', '', '보라색', '이사야 35:1-10', '시편 146:5-10 또는
누가복음 1:46b-55', '야고보서 5:7-10', '마태복음 11:2-11'),
  ('2025-12-21', '대림절 네 번째 주일', '', '', '', '', '', '', '', '', '보라색', '이사야 7:10-16', '시편 80:1-7, 17-19', '로마서 1:1-7', '마태복음 1:18-25'),
  ('2025-12-25', '성탄절(12.25)', '', '', '', '', '', '', '', '', '흰색', '이사야 9:2-7
이사야 62:6-12
이사야 52:7-10', '시편 96
시편 97
시편 98', '디도서 2:11-14
디도서 3:4-7
히브리서 1:1-4, (5-12)', '누가복음 2:1-14, (15-20)
누가복음 2:(1-7), 8-20
요한복음 1:1-14'),
  ('2025-12-28', '성탄절 후 첫 번째 주일', '송년주일,
송구영신', '', '', '', '', '', '', '', '흰색', '이사야 63:7-9', '시편 148', '히브리서 2:10-18', '마태복음 2:13-23'),
  ('2025-12-31', '송구영신예배', '', '', '', '', '', '', '', '', '', '', '', '', ''),
  ('2026-01-04', '성탄절 후 두 번째 주일', '신년주일', '', '', '', '', '', '', '', '', '전도서 3:1-13', '시편 8', '요한계시록 21:1-6a', '마태복음 25:31-46'),
  ('2026-01-06', '주현절(1.6.)', '', '', '', '', '', '', '', '', '흰색', '이사야 60:1-6', '시편 72:1-7, 10-14', '에베소서 3:1-12', '마태복음 2:1-12'),
  ('2026-01-11', '주님의 수세주일', '', '', '', '', '', '', '', '', '흰색', '이사야 42:1-9', '시편 29', '사도행전 10:34-43', '마태복음 3:13-17'),
  ('2026-01-18', '주현절 후 두 번째 주일', '해외선교주일', '', '', '', '', '', '', '', '녹색', '이사야 49:1-7', '시편 40:1-11', '고린도전서 1:1-9', '요한복음 1:29-42'),
  ('2026-01-25', '주현절 후 세 번째 주일', '', '', '', '', '', '', '', '', '녹색', '이사야 9:1-4', '시편 27:1, 4-9', '고린도전서 1:10-18', '마태복음 4:12-23'),
  ('2026-02-01', '주현절 후 네 번째 주일', '', '', '', '', '', '', '', '', '녹색', '미가 6:1-8', '시편 15', '고린도전서 1:18-31', '마태복음 5:1-12'),
  ('2026-02-08', '주현절 후 다섯 번째 주일', '', '', '', '', '', '', '', '', '녹색', '이사야 58:1-9a(9b-12)', '시편 112:1-9(10)', '고린도전서 2:1-12(13-16)', '마태복음 5:13-20'),
  ('2026-02-15', '산상변모주일', '', '', '', '', '', '', '', '', '흰색', '출애굽기 24:12-18', '시편 2 또는 시편 99', '베드로후서 1:16-21', '마태복음 17:1-9'),
  ('2026-02-18', '재의 수요일(2. 18.)', '', '', '', '', '', '', '', '', '보라색
/검은색', '요엘 2:1-2, 12-17 또는
이사야 58:1-12', '시편 51:1-17', '고린도후서 5:20b-6:10', '마태복음 6:1-6, 16-21'),
  ('2026-02-22', '사순절 첫 번째 주일', '', '', '', '', '', '', '', '', '보라색', '창세기 2:15-17, 3:1-7', '시편 32', '로마서 5:12-19', '마태복음 4:1-11'),
  ('2026-03-01', '사순절 두 번째 주일', '성청주일', '', '', '', '', '', '', '', '보라색', '창세기 12:1-4a', '시편 121', '로마서 4:1-5, 13-17', '요한복음 3:1-17 또는
마태복음 17:1-9'),
  ('2026-03-08', '사순절 세 번째 주일', '서울신대기념주일', '', '', '', '', '', '', '', '보라색', '출애굽기 17:1-7', '시편 95', '로마서 5:1-11', '요한복음 4:5-42'),
  ('2026-03-15', '사순절 네 번째 주일', '', '', '', '', '', '', '', '', '보라색', '사무엘상 16:1-13', '시편 23', '에베소서 5:8-14', '요한복음 9:1-41'),
  ('2026-03-22', '사순절 다섯 번째 주일', '', '', '', '', '', '', '', '', '보라색', '에스겔 37:1-14', '시편 130', '로마서 8:6-11', '요한복음 11:1-45'),
  ('2026-03-29', '종려-수난주일', '성결교회전도주간
(3.30.-4.4.)
종려주일
수난주일', '', '', '', '', '', '', '', '보라색', '이사야 50:4-9a', '시편 118:1-2, 19-29
시편 31:9-16', '마태복음 21:1-11
빌립보서 2:5-11', '마태복음 26:14-27:66
또는 마태복음 27:11-54'),
  ('2026-04-02', '성목요일(4.2.)', '', '', '', '', '', '', '', '', '보라색/
빨간색', '출애굽기 12:1-4, (5-10), 11-14', '시편 116:1-2, 12-19', '고린도전서 11:23-26', '요한복음 13:1-17, 31b-35'),
  ('2026-04-03', '성금요일(4.3.)', '', '', '', '', '', '', '', '', '검은색/
빨간색', '이사야 52:13-53:12', '시편 22', '히브리서 10:16-25 또는
히브리서 4:14-16;5:7-9', '요한복음 18:1-19:42'),
  ('2026-04-04', '성토요일(4.4.)', '', '', '', '', '', '', '', '', '보라색', '욥기 14:1-14 또는
예레미야애가 3:1-9, 19-24', '시편 31:1-4, 15-16', '베드로전서 4:1-8', '마태복음 27:57-66 또는
요한복음 19:38-42'),
  ('2026-04-05', '부활주일', '장애인주일', '', '', '', '', '', '', '', '흰색/
금색', '*사도행전 10:34-43 또는
예레미야 31:1-6', '시편 118:1-2, 14-24', '골로새서 3:1-4 또는
사도행전 10:34-43', '요한복음 20:1-18 또는
마태복음 28:1-10'),
  ('2026-04-12', '부활 후 두 번째 주일', '', '', '', '', '', '', '', '', '흰색', '*사도행전 2:14a, 22-32', '시편 16', '베드로전서 1:3-9', '요한복음 20:19-31'),
  ('2026-04-19', '부활 후 세 번째 주일', '', '', '', '', '', '', '', '', '흰색', '*사도행전 2:14a, 36-41', '시편 116:1-4, 12-19', '베드로전서 1:17-23', '누가복음 24:13-35'),
  ('2026-04-26', '부활 후 네 번째 주일', '', '', '', '', '', '', '', '', '흰색', '*사도행전 2:42-47', '시편 23', '베드로전서 2:19-25', '요한복음 10:1-10'),
  ('2026-05-03', '부활 후 다섯 번째 주일', '어린이주일', '', '', '', '', '', '', '', '흰색', '*사도행전 7:55-60', '시편 31:1-5, 15-16', '베드로전서 2:2-10', '요한복음 14:1-14'),
  ('2026-05-10', '부활 후 여섯 번째 주일', '어버이주일', '', '', '', '', '', '', '', '흰색', '*사도행전 17:22-31', '시편 66:8-20', '베드로전서 3:13-22', '요한복음 14:15-21'),
  ('2026-05-14', '주님의 승천일(5.14.)', '', '', '', '', '', '', '', '', '흰색', '*사도행전 1:1-11', '시편 47 또는 93', '에베소서 1:15-23', '누가복음 24:44-53'),
  ('2026-05-17', '부활 후 일곱 번째 주일', '부부주일,성결교회
창립주간 및
웨슬리
회심주간(5.18~23.)', '', '', '', '', '', '', '', '흰색', '*사도행전 1:6-14', '시편 68:1-10, 32-35', '베드로전서 4:12-14;5:6-11', '요한복음 17:1-11'),
  ('2026-05-24', '성령강림주일/오순절', '성결교회주일', '', '', '', '', '', '', '', '빨간색', '*사도행전 2:1-21 또는
민수기 11:24-30', '시편 104:24-34, 35b', '고린도전서 12:3b-13
또는 사도행전 2:1-21', '요한복음 20:19-23 또는
요한복음 7:37-39'),
  ('2026-05-31', '오순절 후 첫 번째 주일
/삼위일체주일', '', '', '', '', '', '', '', '', '흰색', '창세기 1:1-2:4a
시편 8', '', '고린도후서 13:11-13', '마태복음 28:16-20'),
  ('2026-06-07', '오순절 후 두 번째 주일', '농어촌주일', '', '', '', '', '', '', '', '녹색', '창세기 12:1-9
시편 33:1-12', '호세아 5:15-6:6
시편 50:7-15', '로마서 4:13-25', '마태복음 9:9-13, 18-26'),
  ('2026-06-14', '오순절 후 세 번째 주일', '환경주일', '', '', '', '', '', '', '', '녹색', '창세기 18:1-15, (21:1-7)
시편 116:1-2, 12-19', '출애굽기 19:2-8a
시편 100', '로마서 5:1-8', '마태복음 9:35-10:8, (9-23)'),
  ('2026-06-21', '오순절 후 네 번째 주일', '특수전도주일', '', '', '', '', '', '', '', '녹색', '창세기 21:8-21
시편 86:1-10, 16-17', '예레미야 20:7-13
시편 69:7-10, (11-15), 16-18', '로마서 6:1b-11', '마태복음 10:24-39'),
  ('2026-06-28', '오순절 후 다섯 번째 주일', '통일주일', '', '', '', '', '', '', '', '녹색', '창세기 22:1-14
시편 13', '예레미야 28:5-9
시편 89:1-4, 15-18', '로마서 6:12-23', '마태복음 10:40-42'),
  ('2026-07-05', '오순절 후 여섯 번째 주일', '맥추감사주일', '', '', '', '', '', '', '', '녹색', '창세기 24:34-38, 42-49, 58-67
시편 45:10-17 또는
아가 2:8-13', '스가랴 9:9-12
시편 145:8-14', '로마서 7:15-25a', '마태복음 11:16-19, 25-30'),
  ('2026-07-12', '오순절 후 일곱 번째 주일', '교회교육주일', '', '', '', '', '', '', '', '녹색', '창세기 25:19-34
시편 119:105-112', '이사야 55:10-13
시편 65:(1-8), 9-13', '로마서 8:1-11', '마태복음 13:1-9, 18-23'),
  ('2026-07-19', '오순절 후 여덟 번째 주일', '', '', '', '', '', '', '', '', '녹색', '창세기 28:10-19a
시편 139:1-12, 23-24', '이사야 44:6-8
시편 86:11-17', '로마서 8:12-25', '마태복음 13:24-30, 36-43'),
  ('2026-07-26', '오순절 후 아홉 번째 주일', '', '', '', '', '', '', '', '', '녹색', '창세기 29:15-28
시편 105:1-11, 45b
또는 시편 128', '열왕기상 3:5-12
시편 119:129-136', '로마서 8:26-39', '마태복음 13:31-33, 44-52'),
  ('2026-08-02', '오순절 후 열 번째 주일', '', '', '', '', '', '', '', '', '녹색', '창세기 32:22-31
시편 17:1-7, 15', '이사야 55:1-5
시편 145:8-9, 14-21', '로마서 9:1-5', '마태복음 14:13-21'),
  ('2026-08-09', '오순절 후 열한 번째 주일', '해방기념주일', '', '', '', '', '', '', '', '녹색', '창세기 37:1-4, 12-28
시편 105:1-6, 16-22, 45b', '열왕기상 19:9-18
시편 85:8-13', '로마서 10:5-15', '마태복음 14:22-33'),
  ('2026-08-16', '오순절 후 열두 번째 주일', '', '', '', '', '', '', '', '', '녹색', '창세기 45:1-15
시편 133', '이사야 56:1, 6-8
시편 67', '로마서 11:1-2a, 29-32', '마태복음 15:(10-20), 21-28'),
  ('2026-08-23', '오순절 후 열세 번째 주일', '', '온세대 찬양예배', '', '', '', '', '', '', '녹색', '출애굽기 1:8-2:10
시편 124', '이사야 51:1-6
시편 138', '로마서 12:1-8', '마태복음 16:13-20'),
  ('2026-08-30', '오순절 후 열네 번째 주일', '', '', '', '', '', '', '', '', '녹색', '출애굽기 3:1-15
시편 105:1-6, 23-26, 45b', '예레미야 15:15-21
시편 26:1-8', '로마서 12:9-21', '마태복음 16:21-28'),
  ('2026-09-06', '오순절 후 열다섯 번째 주일', '평신도주일', '', '', '', '', '', '', '', '녹색', '출애굽기 12:1-14
시편 149', '에스겔 33:7-11
시편 119:33-40', '로마서 13:8-14', '마태복음 18:15-20'),
  ('2026-09-13', '오순절 후 열여섯 번째 주일', '', '', '', '', '', '', '', '', '녹색', '출애굽기 14:19-31
시편 114 또는
출애굽기 15:1b-11, 20-21', '창세기 50:15-21
시편 103:(1-7), 8-13', '로마서 14:1-12', '마태복음 18:21-35'),
  ('2026-09-20', '오순절 후 열일곱 번째 주일', '순교자기념주일', '', '', '', '', '', '', '', '녹색', '출애굽기 16:2-15
시편 105:1-6, 37-45', '요나 3:10-4:11
시편 145:1-8', '빌립보서 1:21-30', '마태복음 20:1-16'),
  ('2026-09-27', '오순절 후 열여덟 번째 주일', '', '', '', '', '', '', '', '', '녹색', '출애굽기 17:1-7
시편 78:1-4, 12-16', '에스겔 18:1-4, 25-32
시편 25:1-9', '빌립보서 2:1-13', '마태복음 21:23-32'),
  ('2026-10-04', '오순절 후 열아홉 번째 주일', '군선교주일
故김상준추모주간
(10.5-10)', '', '', '', '', '', '', '', '녹색', '출애굽기 20:1-4, 7-9, 12-20
시편 19', '이사야 5:1-7
시편 80:7-15', '빌립보서 3:4b-14', '마태복음 21:33-46'),
  ('2026-10-11', '오순절 후 스무 번째 주일', '', '', '', '', '', '', '', '', '녹색', '출애굽기 32:1-14
시편 106:1-6, 19-23', '이사야 25:1-9
시편 23', '빌립보서 4:1-9', '마태복음 22:1-14'),
  ('2026-10-18', '오순절 후 스물한 번째 주일', '', '', '', '', '', '', '', '', '녹색', '출애굽기 33:12=23
시편 99', '이사야 45:1-7
시편 96:1-9, (10-13)', '데살로니가전서 1:1-10', '마태복음 22:15-22'),
  ('2026-10-25', '오순절 후 스물두 번째 주일', '종교개혁주일', '', '', '', '', '', '', '', '녹색', '신명기 34:1-12
시편 90:1-6, 13-17', '레위기 19:1-2, 15-18
시편 1', '데살로니가전서 2:1-8', '마태복음 22:34-46'),
  ('2026-11-01', '오순절 후 스물세 번째 주일', '', '', '', '', '', '', '', '', '녹색', '여호수아 3:7-17
시편 107:1-7, 33-37', '미가 3:5-12
시편 43', '데살로니가전서 2:9-13', '마태복음 23:1-12'),
  ('2026-11-08', '오순절 후 스물네 번째 주일', '', '', '', '', '', '', '', '', '녹색', '여호수아 24:1-3a, 14-25
시편 78:1-7', '아모스 5:18-24
시편 70', '데살로니가전서 4:13-18', '마태복음 25:1-13'),
  ('2026-11-15', '오순절 후 스물다섯 번째 주일', '추수감사주일', '', '', '', '', '', '', '', '녹색', '사사기 4:1-7
시편 123', '스바냐 1:7, 12-18
시편 90:1-8, (9-11), 12', '데살로니가전서 5:1-11', '마태복음 25:14-30'),
  ('2026-11-22', '왕이신 그리스도 주일', '', '', '', '', '', '', '', '', '녹색', '에스겔 34:11-16, 20-24
시편 100', '에스겔 34:11-16, 20-24
시편 95:1-7a', '에베소서 1:15-23', '마태복음 25:31-46'),
  ('2026-11-29', '대림절 첫 번째 주일', '', '', '', '', '', '', '', '', '보라색', '이사야 64:1-9', '시편 80:1-7, 17-19', '고린도전서 1:3-9', '마가복음 13:24-37'),
  ('2026-12-06', '대림절 두 번째 주일', '', '', '', '', '', '', '', '', '보라색', '이사야 40:1-11', '시편 85:1-2, 8-13', '베드로후서 3:8-15a', '마가복음 1:1-8'),
  ('2026-12-13', '대림절 세 번째 주일', '성서주일', '', '', '', '', '', '', '', '보라색', '이사야 61:1-4, 8-11', '시편 126 또는
누가복음 1:46b-55', '데살로니가전서 5:16-24', '요한복음 1:6-8, 19-28'),
  ('2026-12-20', '대림절 네 번째 주일', '', '', '', '', '', '', '', '', '보라색', '사무엘하 7:1-11, 16', '누가복음 1:46b-55
또는 시편 89:1-4, 19-26', '로마서 16:25-27', '누가복음 1:26-38'),
  ('2026-12-25', '성탄절(12.25.)', '', '', '', '', '', '', '', '', '흰색', '이사야 9:2-7
이사야 62:6-12
이사야 52:7-10', '시편 96
시편 97
시편 98', '디도서 2:11-14
디도서 3:4-7
히브리서 1:1-4, (5-12)', '누가복음 2:1-14, (15-20)
누가복음 2:(1-7), 8-20
요한복음 1:1-14'),
  ('2026-12-27', '성탄절 후 첫 번째 주일', '송년주일
송구영신(12.31.)', '', '', '', '', '', '', '', '흰색', '이사야 61:10-62:3', '시편 148', '갈라디아서 4:4-7', '누가복음 2:22-40'),
  ('2026-12-31', '송구영신예배', '', '', '', '', '', '', '', '', '', '', '', '', '')
on conflict (date) do update set
  liturgical = excluded.liturgical,
  note = excluded.note,
  church_schedule = excluded.church_schedule,
  liturgical_color = excluded.liturgical_color,
  first_reading = excluded.first_reading,
  psalm = excluded.psalm,
  second_reading = excluded.second_reading,
  gospel = excluded.gospel;
